# 9 step for EDA

In [7]:
# for dataset: https://archive.ics.uci.edu/

### step : 1    Data collection

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [9]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
# save data to excel file
df.to_excel('./dataset/titanc.xlsx', index=False)

In [11]:
# import dataset in python
df_iris = pd.read_excel('./dataset/titanc.xlsx')

### step: 2    Data Cleaning

### step: 3   Data Exploration(Exploratory Data Analysis-EDA)

### step: 4 Feature Engineering

### step: 5 Data Modeling

### step: 6 Model Evaluation

### step: 7 Drawing conclusion & Insights

### step: 8 Automating and sharing results